const todoList = [
  {
    id: 1,
    text: 'Пойти в жопу',
    done: false
  },
  {
    id: 2,
    text: 'Пойти в магаз',
    done: false
  },
  {
    id: 3,
    text: 'Пойти в магаз',
    done: false
  },
]

// Условия

// reate-react-app с todo листом.
// лист можно пополнить или удалить элем.
// должна быть реализована сортировка по всем полям.
// При изменение порядка СОРТИРОВКОЙ список должен анимироватся.

// Доп условия: драг-енд-дроп при котором список будет менять свои позиции анимированно.